Repository: palomarl/74531705
Catalog: omegat/project_save.tmx
Source language: en
Languages: es_es

source: Even if your toy is supposed to be waterproof, it’s better to play it safe then end up with a vibrator that no longer vibes.
es_es: Aunque se supone que el juguete es resistente al agua, es mejor ir sobre seguro que acabar con un vibrador que ya no vibra.

source: Even men tend to have a longer and more intense orgasm when they use a vibrator, whether they’re buzzing their balls or prostate.
es_es: Incluso los hombres suelen tener un orgasmo más intenso y largo cuando usan un vibrador, tanto como si están estimulando sus testículos o su próstata.

source: Every touch leaves you exploding with pleasure!
es_es: Cada toque hará que explotes del placer!

source: Experience oral-like sensations with 3 toe-curling suction speeds
es_es: Experimenta sensaciones similares a las orales con 3 velocidades de succión que te harán enloquecer

source: Experiment with 9 vibration modes for a wide variety of stimulation options.
es_es: Experimenta con 9 modos de vibración para tener una gran variedad de opciones al estimularte.

source: Explore your whole body by teasing your breasts and nipples, rubbing your inner thighs, and stimulating other sensitive erogenous zones other than your clit and vagina.
es_es: Explora todo tu cuerpo acariciándote los pechos y los pezones, frotándote el interior de los muslos y estimulando otras zonas erógenas sensibles además del clítoris y la vagina.

source: Fabrics are any form of woven textile.
es_es: Los tejidos son cualquier tipo de materia textil.

source: Faux leather is usually easy to clean, tend to be more durable and sometimes have a lining.
es_es: La piel sintética suele ser fácil de limpiar, más duradera y a veces viene con un forro.

source: Feel 10 pulsating air functions from mild to wild
es_es: - Siente 10 funciones de aire pulsante de suave a salvaje

source: Feel thrumming, fluttering, pulsing air surround your sensitive nipples and thrill it from all angles.
es_es: Siente cómo el aire pulsante rodea tus sensibles pezones y los estremece desde todos los ángulos.

source: Female masturbation is a little more complicated.
es_es: La masturbación femenina es un poco más complicada.

source: Female masturbation, on the other hand, is completely side-effect free.
es_es: En cambio, la masturbación femenina no tiene ningún efecto secundario.

source: First, is how you plan to use them.
es_es: En primer lugar, cómo piensa utilizarlas.

source: First, it uses air-powered technology to gently suck on your bits.
es_es: En primer lugar, utiliza la tecnología de aire para succionar suavemente tus partes.

source: Focus vibrations on your G-Spot or clit for more intense pleasure with the indented edge
es_es: - Concentra las vibraciones en tu Punto G o clítoris para un placer más intenso con el borde dentado

source: For best results, apply a small dab of the cream to yourself roughly 10 to 15 minutes before having sex.
es_es: Para obtener los mejores resultados, aplícate una pequeña cantidad de crema entre 10 y 15 minutos antes de mantener relaciones sexuales.

source: For best results, we recommend doing 3 sets of Kegel exercises per day, one in the morning, one in the afternoon, and one at night.
es_es: Para mejores resultados, recomendamos hacer 3 sets de ejercicios de Kegel al día, uno por la mañana, uno por la tarde y uno por la noche.

source: For every time you round the board, you’ll collect a ring and the level of intimacy will increase.
es_es: Por cada vuelta que des al tablero, recogerás un anillo y aumentará el nivel de intimidad.

source: For extra thrills, the egg vibrator features a special indented edge that helps enhance the buzzing sensation – especially when it rubs against your G-Spot.
es_es: Para mayor emoción, el huevo vibrador cuenta con un borde dentado especial que ayuda a aumentar la sensación de zumbido, especialmente cuando se frota contra el punto G.

source: For instance, toys made from soft and flexible materials like TPE or TPR need a mild facial soap.
es_es: Por ejemplo, los juguetes fabricados con materiales suaves y flexibles como el TPE o el TPR necesitan un jabón facial suave.

source: Frequent masturbation can make you feel tired.
es_es: Masturbarte frecuentemente puede hacer que te sientas cansado.

source: Fully waterproof for wet & wild fun in the shower
es_es: Totalmente a prueba de agua para que puedas tener una ducha húmeda y salvaje llena de diversión

source: Gently insert the first ball inside your vagina.
es_es: Introduce suavemente la primera bola en el interior de la vagina.

source: Get ready because you’re in for the best sex you’ve ever had!
es_es: Prepárate porque te espera el mejor sexo de tu vida.

source: Get wet & wild in the shower – it’s fully waterproof
es_es: Mójate y disfruta en la ducha: es totalmente impermeable

source: Given the nature of anal toys, it’s particularly important to keep them clean.
es_es: Dada la naturaleza de los juguetes anales, es especialmente importante mantenerlos limpios.

source: Glass
es_es: Vidrio

source: Go from suggestive pink ‘Intimacy’ cards to naughtier ‘Passionate’ cards all the way to ‘Steamy’ cards – guaranteed to get you hot under the collar!
es_es: Pasa de las sugerentes cartas rosas de "Intimidad" a las más traviesas de "Pasión", hasta llegar a las cartas de "Vapor": ¡seguro que te pones cachondo!

source: Grab a tissue and ejaculate into it.
es_es: Coge un pañuelo y eyacula en él.

source: Great for solo play and foreplay, too!
es_es: Ideal también para juegos en solitario y preliminares.

source: Half foam-lined underwired cups
es_es: Medias copas con aros forradas de espuma

source: Hand wash in cold water, hang to dry
es_es: Lavar a mano en agua fría, colgar para secar

source: Here are the answers to some of your most popular masturbation questions.
es_es: Aquí están las respuestas a algunas de vuestras preguntas más populares sobre la masturbación.

source: Here's how you can get the fun started with a pair of vibrating Ben Wa Balls.
es_es: A continuación te explicamos cómo puedes empezar a utilizar las Bolas Ben Wa para los ejercicios de Kegel.

source: Here's how you can start using Ben Wa Balls for Kegel exercises.
es_es: A continuación te explicamos cómo puedes empezar a utilizar las Bolas Ben Wa para los ejercicios de Kegel.

source: Here's my masturbation advice to help you get started:
es_es: Estos son mis consejos sobre masturbación para ayudarte a empezar:

source: Hold the opening up to a water faucet and turn it on – forcing water into the chamber.
es_es: Acerca la abertura a un grifo de agua y ábrelo, forzando la entrada de agua en la cámara.

source: Hold the power button down for approximately 3 seconds to turn it on.
es_es: Mantén pulsado el botón de encendido durante unos 3 segundos para encenderlo.

source: Holding onto the ball’s weight strengthens your kegels – and it feels so good, you may find yourself “working out” often.
es_es: Sujetar el peso de la pelota fortalece los músculos kegel, y la sensación es tan agradable que es posible que "entrenes" a menudo.

source: Hook & eye back closure in back
es_es: Cierre de corchete en la espalda

source: How many calories does masturbation burn?
es_es: ¿Cuántas calorías quema la masturbación?

source: How much masturbation is too much?
es_es: ¿Cuánta masturbación es demasiada?

source: How much time do you spend masturbating graphic
es_es: Gráfico: ¿Cuánto tiempo pasas masturbándote?

source: How often should you masturbate?
es_es: ¿Con qué frecuencia debes masturbarse?

source: How often you masturbate depends on your current relationship status and your sex drive.
es_es: La frecuencia con la que te masturbas depende de tu estado sentimental actual y de tu apetito sexual.

source: How to Buy Lingerie: Picking the Right Material
es_es: Cómo comprar lencería y elegir el material adecuado

source: How to Choose Ben Wa Balls
es_es: Cómo elegir las bolas Ben Wa

source: How to Clean Anal Toys
es_es: Cómo limpiar los juguetes anales

source: How to Clean Masturbators & Strokers
es_es: Cómo limpiar masturbadores masculinos

source: How to Clean Realistic Sex Toys
es_es: Cómo limpiar juguetes sexuales realistas

source: How to Clean Sex Toys
es_es: Cómo limpiar los juguetes sexuales

source: How to Clean Vibrators (Battery-Powered & Rechargeable)
es_es: Cómo limpiar vibradores (a pilas y recargables)

source: How to Masturbate: A Hands-On Guide
es_es: Cómo masturbarse: Guía práctica

source: How to Masturbate: A Sex Therapist’s Tips for Women & Men | Adam & Eve's Guide to Sex
es_es: Cómo masturbarse: Los consejos de una terapeuta sexual para mujeres y hombres | La guía sexual de Adam & Eve

source: How to Use Ben Wa Balls
es_es: Cómo utilizar las bolas Ben Wa

source: How to Use Ben Wa Balls for Kegels & Masturbation | Adam & Eve's Guide to Sex
es_es: Cómo usar las bolas Ben Wa para ejercicios de Kegel y masturbación | Guía de Adam & Eve para el Sexo

source: However, that’s caused primarily by psychological factors – the same ones that lead to other addictions like gambling or drug abuse – and not due to masturbation itself.
es_es: Sin embargo, eso se debe principalmente a factores psicológicos (los mismos que conducen a otras adicciones como el juego o la drogadicción) y no a la masturbación en sí.

source: I'm a certified therapist and sexologist as well as a licensed marriage and family therapist with a doctorate in Clinical Sexology and a Master of Education in Counseling Psychology & Marriage and Family Therapy.
es_es: Soy una terapeuta y sexóloga certificada, así como una terapeuta matrimonial y familiar licenciada con un doctorado en Sexología Clínica y un Máster en Psicología del Asesoramiento y Terapia Matrimonial y Familiar.

source: Ideal for spicing up your love life!
es_es: ¡Ideal para hacer vuestra vida amorosa más picante!

source: If it was dangerous, we would have figured it out by now.
es_es: Si fuera peligroso, ya lo habríamos descubierto.

source: If that feels good, insert the second ball as well.
es_es: Si te sientes bien, introduce también la segunda bola.

source: If that feels good, then insert any cord that might connect your Ben Wa Balls along with the second ball.
es_es: Si se siente bien, entonces inserte el cordón que conecta sus Ben Wa Balls junto con la segunda bola.

source: If that feels good, then try some of the more intense vibration speeds and patterns.
es_es: Si te sientes bien, prueba con velocidades y patrones de vibración más intensos.

source: If that feels good, you could try speeding up the pace or even adding another finger or two.
es_es: Si te sientes bien, puedes intentar acelerar el ritmo o incluso añadir uno o dos dedos más.

source: If we don't know about our own pleasure spots, how are we going to be able to tell a partner where to find them!
es_es: Si no conocemos nuestros propios puntos de placer, ¡cómo vamos a poder decirle a una pareja dónde encontrarlos!

source: If you call in sick at work or make excuses so you can spend more time masturbating, you’re doing it too much.
es_es: Si dices que estás enfermo en el trabajo o pones excusas para poder pasar más tiempo masturbándote, es que lo estás haciendo demasiado.

source: If you do climax, then great!
es_es: Si llegas al clímax, ¡genial!

source: If you don’t keep them clean, those tunnels can quickly become home to all kinds of nasty germs and bacteria.
es_es: Si no los mantienes limpios, esos túneles pueden convertirse rápidamente en el hogar de todo tipo de gérmenes y bacterias desagradables.

source: If you feel like you need a little extra power, then add a sex toy like a dildo or vibrator.
es_es: Si sientes que necesitas un poco más de potencia, añade un juguete sexual como un consolador o un vibrador.

source: If you find yourself cutting back on time with friends, so you can masturbate, you’re doing it too much.
es_es: Si te das cuenta de que reduces el tiempo que pasas con tus amigos para poder masturbarte, es que lo estás haciendo demasiado.

source: If you have non-vibrating balls, you can simply wash them in warm, soapy water, spray them with a sex toy cleaner, and dry them with a clean cloth.
es_es: Si tienes bolas que no vibran, basta con lavarlas con agua tibia y jabón, rociarlas con un limpiador de juguetes eróticos y secarlas con un paño limpio.

source: If you have vibrating balls, spray them with a sex toy cleaner, wipe them down with damp cloth, and then dry them off.
es_es: Si tienes bolas vibradoras, rocíalas con un limpiador de juguetes eróticos, límpialas con un paño húmedo y sécalas.

source: If you insist on cleaning your sex toy the old-fashioned way with soap, water and muscle power, then you need to take some special measures based on the type of material your toy is made from.
es_es: Si insistes en limpiar tu juguete sexual a la antigua usanza, con agua, jabón y fuerza muscular, debes tomar algunas medidas especiales en función del tipo de material del que esté hecho tu juguete.

source: If you run out of the renewal powder, you can order more from Adam & Eve.
es_es: Si se te acaba el polvo renovador, puedes pedir más en Adam & Eve.

source: If you want them primarily for Kegel exercises, then you're better off with a non-vibrating pair.
es_es: Si las quieres principalmente para los ejercicios de Kegel, entonces es mejor que compres un par que no vibre.

source: If you want to know the answers to common questions such as "Is masturbation healthy?" or "Does masturbation have any side effects?," this guide delivers.
es_es: Si quieres conocer las respuestas a preguntas tan comunes como "¿Es sana la masturbación?" o "¿Tiene efectos secundarios?", esta guía te las ofrece.

source: If you want to use them for masturbation in addition to exercising, then you should get some that vibrate.
es_es: Si, además de para los ejercicios, quieres utilizarlas para masturbarte, entonces deberías comprar unas que vibren.

source: If you want to use your Kegel Balls for masturbation, then you'll really want a pair that offers more stimulation.
es_es: Si quieres usar tus bolas Kegel para la masturbación, entonces preferirás un par que ofrezca más estimulación.

source: If your balls are brand new, wash them first.
es_es: Si tus bolas son nuevas, lávalas primero.

source: If your balls are silicone, you should store them in their own bag to prevent them from coming into contact with other sex toys.
es_es: Si tus bolas son de silicona, debes guardarlas en su propia bolsa para evitar que entren en contacto con otros juguetes sexuales.

source: If your kegel muscles aren’t their strongest, you might be missing out on reaching your full pleasure potential!
es_es: Si tus músculos kegel no son los más fuertes, puede que te estés perdiendo la oportunidad de alcanzar todo tu potencial de placer.

source: If your sex toy falls under one of those three categories, check out the special advice outlined below for more details about keeping it clean.
es_es: Si tu juguete sexual pertenece a una de estas tres categorías, consulta los consejos especiales que se indican a continuación para obtener más información sobre cómo mantenerlo limpio.

source: If you’re new to training, you may want to start with the single ball trainer.
es_es: Si es la primera vez que se entrena, le recomendamos que empiece con el ejercitador de una sola bola.

source: If you’re still having difficulty climaxing with your partner even when using the clit sensitizer, then you should try a rabbit vibrator instead.
es_es: Si sigues teniendo dificultades para llegar al clímax con tu pareja aunque utilices el sensibilizador de clítoris, prueba con un vibrador conejo.

source: If you’re using soap and water to clean your anal toy, make sure to use an antibacterial soap and hot water.
es_es: Si utilizas agua y jabón para limpiar tu juguete anal, asegúrate de utilizar un jabón antibacteriano y agua caliente.

source: If you’ve got a dirty anal toy sitting in the sink and don’t have time to read through all the information, then we’ve created a quick and easy reference guide to help you out.
es_es: Si tienes un juguete anal sucio en el lavabo y no tienes tiempo de leer toda la información, hemos creado una guía de referencia rápida y sencilla para ayudarte.

source: Imported
es_es: Importado

source: In Stock
es_es: En stock

source: In addition to Kegel exercises, it's also possible to use Ben Wa Balls for sexual stimulation.
es_es: Además de los ejercicios de Kegel, también es posible usar las Bolas Ben Wa para estimulación sexual.

source: In fact, if you masturbate regularly, you might even build up some extra arm strength.
es_es: De hecho, si te masturbas con regularidad, puede que incluso ganes algo más de fuerza en los brazos.

source: In luxurious silicone with ABS plastic base
es_es: - De lujosa silicona con base de plástico ABS

source: Included are two kegel trainers.
es_es: Se incluyen dos entrenadores de kegel.

source: Increase satisfaction & have better, stronger orgasms
es_es: Aumente la satisfacción y tenga orgasmos mejores y más intensos

source: Ingredients: Water, Propylene Glycol, L-Arginine, Hydroxyethylcellulose, Menthol, Methyl Paraben, Tetrasodium EDTA
es_es: Ingredientes: Agua, propilenglicol, L-arginina, hidroxietilcelulosa, mentol, metilparabeno, EDTA tetrasódico.

source: Insert the first ball slowly and steadily.
es_es: Introduce la primera bola despacio y con firmeza.

source: Invite along a playmate and let them slide the balls in and out with the easy ringed retrieval cord.
es_es: Invita a un compañero de juegos y deja que introduzca y extraiga las bolas con el sencillo cordón anillado.

source: Is masturbation good for you?
es_es: ¿Es buena la masturbación?

source: Is masturbation healthy?
es_es: ¿Es sana la masturbación?

source: Is masturbation normal?
es_es: ¿Es normal masturbarse?

source: It depends on how active and how long you masturbate.
es_es: Depende de lo activo que seas y del tiempo que tardes en masturbarte.

source: It even comes with a special travel lock so the vibrations won’t turn on accidentally.
es_es: Incluso viene con un cierre especial de viaje para que el vibrador no se encienda accidentalmente.

source: It even works underwater for bath or shower time pleasure!
es_es: Funciona incluso bajo el agua para disfrutar del placer en la ducha o el baño.

source: It is comfortable and drapes well but based on whether it’s blended or not may require more effort in the care department.
es_es: Es cómodo y queda bien, pero dependiendo de si está mezclado o no con otro material, puede requerir más cuidados.

source: It is elastic, wrinkle resistant and super easy to care for.
es_es: Es elástico, resistente a las arrugas y muy fácil de cuidar.

source: It is possible for both men and women to become addicted to masturbation.
es_es: Es posible que tanto hombres como mujeres se vuelvan adictos a la masturbación.

source: It might be annoying, but your health is worth taking a few extra minutes.
es_es: Puede resultar molesto, pero tu salud merece que dediques unos minutos más.

source: It might be as simple as rubbing the clit and nipples.
es_es: Puede ser tan simple como frotar el clítoris y los pezones.

source: It might be tempting to wait until the next morning, especially when you’re basking in the glow of a good O. But germs and bacteria can dramatically multiple in those few hours and make your anal toy much harder to clean later on.
es_es: Puede ser tentador esperar hasta la mañana siguiente, especialmente cuando estás disfrutando del resplandor de un buen orgasmo. Pero los gérmenes y las bacterias pueden multiplicarse dramáticamente en esas pocas horas y hacer que tu juguete anal sea mucho más difícil de limpiar más tarde.

source: It might involve inserting a finger (or two or three) inside the vagina.
es_es: También puede consistir en introducir un dedo (o dos, o tres) en la vagina.

source: It might seem counter-intuitive, but bigger, lighter-weight balls are better for beginners.
es_es: Puede parecer contrario a la intuición, pero las pelotas más grandes y ligeras son mejores para los principiantes.

source: It might take you some time and experimentation before having an orgasm, but you can get there.
es_es: Puede que te lleve algún tiempo experimentar antes de llegar al orgasmo, pero puedes conseguirlo.

source: It should be tight enough for you to feel but not so tight as to actually squeeze your shaft.
es_es: Debe estar lo suficientemente apretado como para que puedas sentirlo, pero no tanto como para apretarlo.

source: It takes about 2 hours to fully recharge the vibe.
es_es: El vibrador tarda unas 2 horas en recargarse por completo.

source: It too is easy to care for.
es_es: También es fácil de cuidar.

source: It's essential to masturbate.
es_es: Es esencial masturbarse.

source: Item #125X
es_es: Artículo nº 125X

source: Item #901M
es_es: Artículo #901M

source: Its romantic shape also makes a great gift.
es_es: Su forma romántica también es un regalo estupendo.

source: It’s a different story if you masturbate excessively, i.e. multiple times a day for an extended period of time.
es_es: La cosa cambia si te masturbas en exceso, por ejemplo, si lo haces varias veces al día durante un largo periodo de tiempo.

source: Jelly
es_es: Viscoso

source: Just because your sex toy looks like a penis or a vagina doesn’t mean it requires special cleaning instructions.
es_es: Que tu juguete sexual parezca un pene o una vagina no significa que requiera instrucciones especiales de limpieza.

source: Just don't do that too often.
es_es: Pero no lo hagas con demasiada frecuencia.

source: Just don't let masturbation start dictating or controlling your life.
es_es: Pero no dejes que la masturbación dicte o controle tu vida.

source: Just make sure to clean inside the tunnel as well as outside!
es_es: Asegúrate de limpiar tanto el interior como el exterior del túnel.

source: Just remember to keep the motor and battery compartment dry.
es_es: Solo tienes que acordarte de mantener secos el motor y el compartimento de las pilas.

source: Keep your vibe fully charged with the included USB cord so it’s ready to go next time.
es_es: Mantén tu vibrador completamente cargado con el cable USB incluido para que esté listo la próxima vez.

source: Kegel Balls are also great for improving bladder control and preventing incontinence.
es_es: Las bolas Kegel también son buenas para mejorar el control de la vejiga y prevenir la incontinencia.

source: Last, but not least, men and women alike can learn how to masturbate!
es_es: Por último, pero no por ello menos importante, ¡tanto hombres como mujeres pueden aprender a masturbarse!

source: Latex, PVC & Rubber
es_es: Látex, PVC y caucho

source: Learn about masturbation benefits, techniques & more.
es_es: Descubre los beneficios de la masturbación, algunas técnicas y más.

source: Let your lover take charge for even more fun
es_es: - Deja que tu amante tome las riendas para disfrutar aún más

source: Lie down in a comfortable position with your legs spread apart.
es_es: Túmbate en una posición cómoda con las piernas separadas.

source: Lightly rub the cream all over your clitoris for complete coverage.
es_es: Frota ligeramente la crema por todo el clítoris para cubrirlo por completo.

source: Like anal toys, masturbators and strokers can be pretty tricky to clean.
es_es: Al igual que los juguetes anales, los masturbadores masculinos pueden ser bastante difíciles de limpiar.

source: Likewise, changing your grip from snug to tight or even loose makes your hand feel like you're having sex with another person.
es_es: Del mismo modo, cambiar el agarre de menos a más apretado o incluso suelto hace que tu mano se sienta como si estuvieras practicando sexo con otra persona.
